ERP.belugaerp/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказПоставщику</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЗагруженИзТОиР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КоличествоБутылок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбъемБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОплатаЗаПоставкуПослеРеализацииТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОснованиеЗаказа</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПунктПогрузки</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СозданНаОснованииЗаказовКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлительностьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>бг_КоличествоКоробок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_КоличествоПаллет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_УпаковкаПаллета</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_ЕстьАлкогольнаяПродукция</name>
    <comment>// Признак что требуется ТТН</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕстьМаркируемаяАлкогольнаяПродукция</name>
    <comment>// Признак что требуются марки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НеАктуализироватьЗаказыКлиентовПоРезервам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_РазрешитьПараллельнуюСборку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипПриемки</name>
    <type>
      <types>CatalogRef.битТипыПриемкиWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/CommonModules/ЗаказКлиентаЛокализация/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Проведение

&После("ЗарегистрироватьУчетныеМеханизмы")
Процедура бг_ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента)
	
	МеханизмыДокумента.Добавить("бг_СкидкиНаценки");
	МеханизмыДокумента.Добавить("бг_РезервыТоваров");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
&После("ДополнитьТекстыЗапросовПроведения")
Процедура бг_ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры)
	
	бг_ДобавитьДвиженияНакопительныхСкидок(Запрос, ТекстыЗапроса, Регистры);
	бг_ТекстЗапросаТаблицаСуммовыеСкидиГлобальные(Запрос, ТекстыЗапроса, Регистры);
	бг_ДобавитьДвиженияРезервыТоваров(Запрос, ТекстыЗапроса, Регистры);
	
КонецПроцедуры

Процедура бг_ДобавитьДвиженияНакопительныхСкидок(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра      = Метаданные.РегистрыНакопления.бг_СуммовыеСкидкиЛокальные.Имя;
	МенеджерРегистра = РегистрыНакопления[ИмяРегистра];
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Запрос.Параметры.Свойство("бг_ПунктНазначения") Тогда
		ПунктНазначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запрос.Параметры.Ссылка, "бг_ПунктНазначения");
		Запрос.УстановитьПараметр("ПунктНазначения", ПунктНазначения);
	КонецЕсли;
	Запрос.УстановитьПараметр("СуммоваяСкидкаCRM", бг_КонстантыПовтИсп.ЗначениеКонстанты("СуммоваяСкидкаCRM"));
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&ПунктНазначения КАК ПунктНазначения,
	|	С.СкидкаНаценка КАК СкидкаНаценка,
	|	СУММА(С.бг_СуммаНачислено) КАК Начислено
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.СкидкиНаценки КАК С
	|		ПО Т.Ссылка = С.Ссылка
	|			И Т.КлючСвязи = С.КлючСвязи
	|			И (Т.Ссылка = &Ссылка)
	|			И (С.СкидкаНаценка.бг_Накопительная)
	|			И (С.СкидкаНаценка <> &СуммоваяСкидкаCRM)
	|			И (НЕ Т.Отменено)
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ДатаОтгрузки,
	|	С.СкидкаНаценка
	|
	|ИМЕЮЩИЕ
	|	СУММА(С.бг_СуммаНачислено) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	&Организация,
	|	&Контрагент,
	|	&ПунктНазначения,
	|	С.СкидкаНаценка,
	|	СУММА(С.бг_СуммаСписанияНакопительнойСкидки)
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.СкидкиНаценки КАК С
	|		ПО Т.Ссылка = С.Ссылка
	|			И Т.КлючСвязи = С.КлючСвязи
	|			И (Т.Ссылка = &Ссылка)
	|			И (С.СкидкаНаценка <> &СуммоваяСкидкаCRM)
	|			И (НЕ Т.Отменено)
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ДатаОтгрузки,
	|	С.СкидкаНаценка
	|
	|ИМЕЮЩИЕ
	|	СУММА(С.бг_СуммаСписанияНакопительнойСкидки) <> 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

Процедура бг_ТекстЗапросаТаблицаСуммовыеСкидиГлобальные(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "бг_СуммовыеСкидки";
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	Запрос.УстановитьПараметр("СуммоваяСкидкаCRM", бг_КонстантыПовтИсп.ЗначениеКонстанты("СуммоваяСкидкаCRM"));
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ЗаказКлиентаСкидкиНаценки.Ссылка.Контрагент КАК Контрагент,
	|	ЗаказКлиентаСкидкиНаценки.Ссылка КАК ДокументРезерва,
	|	0 КАК СуммаСкидки,
	|	СУММА(ЗаказКлиентаСкидкиНаценки.Сумма) КАК СуммаРезерва
	|ИЗ
	|	Документ.ЗаказКлиента.СкидкиНаценки КАК ЗаказКлиентаСкидкиНаценки
	|ГДЕ
	|	ЗаказКлиентаСкидкиНаценки.Ссылка = &Ссылка
	|	И ЗаказКлиентаСкидкиНаценки.СкидкаНаценка = &СуммоваяСкидкаCRM
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаСкидкиНаценки.Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
КонецПроцедуры

Процедура бг_ДобавитьДвиженияРезервыТоваров(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра      = Метаданные.РегистрыНакопления.бг_РезервыТоваров.Имя;
	МенеджерРегистра = РегистрыНакопления[ИмяРегистра];
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	//создание резерва на складе из свободного остатка
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ДД.Ссылка КАК ДолгосрочныйРезерв,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказКлиента,
	|	НЕОПРЕДЕЛЕНО КАК ЗаказПоставщику,
	|	ДД.Склад КАК Склад,
	|	Строки.Номенклатура КАК Номенклатура,
	|	Строки.бг_УпаковкаПаллета КАК УпаковкаПаллета,
	|	Строки.Количество КАК НаСкладе,
	|	0 КАК УПоставщика,
	|	0 КАК Поступило,
	|	0 КАК Выбыло,
	|	0 КАК Отменено
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДД
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Ссылка = &Ссылка
	|	И ДД.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ЗаказПоставщикуИсточникОбеспечения = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И Строки.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	//создание резерва в пути
	|ВЫБРАТЬ
	|	&Период,
	|	Строки.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	Строки.бг_ЗаказПоставщикуИсточникОбеспечения,
	|	НЕОПРЕДЕЛЕНО,
	|	Строки.Номенклатура,
	|	Строки.бг_УпаковкаПаллета,
	|	0 КАК НаСкладе,
	|	Строки.Количество КАК УПоставщика,
	|	0 КАК Поступило,
	|	0 КАК Выбыло,
	|	0 КАК Отменено
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДД
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Ссылка = &Ссылка
	|	И ДД.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ЗаказПоставщикуИсточникОбеспечения <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| 
	// отмена резерва на складе
	|ВЫБРАТЬ
	|	&Период,
	|	ДД.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.Склад,
	|	Строки.Номенклатура,
	|	Строки.бг_УпаковкаПаллета,
	|	0 КАК НаСкладе,
	|	0 КАК УПоставщика,
	|	0 КАК Поступило,
	|	0 КАК Выбыло,
	|	Строки.Количество КАК Отменено
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДД
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Ссылка = &Ссылка
	|	И Строки.Отменено
	|	И ДД.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ЗаказПоставщикуИсточникОбеспечения = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И Строки.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| 
	// отмена резерва поступившего на склад
	|ВЫБРАТЬ
	|	&Период,
	|	ДД.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.Склад,
	|	Строки.Номенклатура,
	|	Строки.бг_УпаковкаПаллета,
	|	0 КАК НаСкладе,
	|	0 КАК УПоставщика,
	|	0 КАК Поступило,
	|	0 КАК Выбыло,
	|	Строки.Количество КАК Отменено
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДД
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Ссылка = &Ссылка
	|	И Строки.Отменено
	|	И ДД.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ЗаказПоставщикуИсточникОбеспечения <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И Строки.бг_ПриходныйОрдерОбособленногоОбеспечения <> ЗНАЧЕНИЕ(Документ.ПриходныйОрдерНаТовары.ПустаяСсылка)
	|	И Строки.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// отмена резерва в пути
	|ВЫБРАТЬ
	|	&Период,
	|	ДД.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	Строки.бг_ЗаказПоставщикуИсточникОбеспечения,
	|	НЕОПРЕДЕЛЕНО,
	|	Строки.Номенклатура,
	|	Строки.бг_УпаковкаПаллета,
	|	0 КАК НаСкладе,
	|	0 КАК УПоставщика,
	|	0 КАК Поступило,
	|	0 КАК Выбыло,
	|	Строки.Количество КАК Отменено
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДД
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Ссылка = &Ссылка
	|	И Строки.Отменено
	|	И ДД.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ЗаказПоставщикуИсточникОбеспечения <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// поступление на склад долгосрочного резерва
	|ВЫБРАТЬ
	|	&Период,
	|	Строки.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	Строки.бг_ЗаказПоставщикуИсточникОбеспечения,
	|	НЕОПРЕДЕЛЕНО,
	|	Строки.Номенклатура,
	|	Строки.бг_УпаковкаПаллета,
	|	0 КАК НаСкладе,
	|	0 КАК УПоставщика,
	|	Строки.Количество КАК Поступило,
	|	0 КАК Выбыло,
	|	0 КАК Отменено
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДД
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Ссылка = &Ссылка
	|	И ДД.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ЗаказПоставщикуИсточникОбеспечения <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И Строки.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// если по заказу поставщика поступило под заказ клиента, а не под долгосрочный резерв, то уменьшаем поступление под резерв
	|ВЫБРАТЬ
	|	ДД.ДатаОтгрузки,
	|	Строки.бг_ЗаказКлиентаИсточникОбеспечения,
	|	НЕОПРЕДЕЛЕНО,
	|	Строки.бг_ЗаказПоставщикуИсточникОбеспечения,
	|	НЕОПРЕДЕЛЕНО,
	|	Строки.Номенклатура,
	|	Строки.бг_УпаковкаПаллета,
	|	0 КАК НаСкладе,
	|	0 КАК УПоставщика,
	|	- Строки.Количество КАК Поступило,
	|	0 КАК Выбыло,
	|	0 КАК Отменено
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДД
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Ссылка = &Ссылка
	|	И НЕ Строки.Отменено
	|	И НЕ ДД.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ЗаказПоставщикуИсточникОбеспечения <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И Строки.бг_ЗаказКлиентаИсточникОбеспечения <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И Строки.бг_ЗаказКлиентаИсточникОбеспечения.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ПриходныйОрдерОбособленногоОбеспечения <> ЗНАЧЕНИЕ(Документ.ПриходныйОрдерНаТовары.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// перенос резерва в пути с долгосрочного на заказ клиента
	|ВЫБРАТЬ
	|	ДД.ДатаОтгрузки,
	|	Строки.бг_ЗаказКлиентаИсточникОбеспечения,
	|	Строки.Ссылка,
	|	Строки.бг_ЗаказПоставщикуИсточникОбеспечения,
	|	НЕОПРЕДЕЛЕНО,
	|	Строки.Номенклатура,
	|	Строки.бг_УпаковкаПаллета,
	|	0 КАК НаСкладе,
	|	0 КАК УПоставщика,
	|	0 КАК Поступило,
	|	Строки.Количество КАК Выбыло,
	|	0 КАК Отменено
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДД
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Ссылка = &Ссылка
	|	И НЕ Строки.Отменено
	|	И НЕ ДД.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ЗаказПоставщикуИсточникОбеспечения <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И Строки.бг_ЗаказКлиентаИсточникОбеспечения <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И Строки.бг_ЗаказКлиентаИсточникОбеспечения.бг_ДолгосрочныйРезерв
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// резервирование в пути на свободный остаток под заказ клиента
	|ВЫБРАТЬ
	|	ДД.ДатаОтгрузки,
	|	Строки.бг_ЗаказКлиентаИсточникОбеспечения,
	|	Строки.Ссылка,
	|	Строки.бг_ЗаказПоставщикуИсточникОбеспечения,
	|	НЕОПРЕДЕЛЕНО,
	|	Строки.Номенклатура,
	|	Строки.бг_УпаковкаПаллета,
	|	0 КАК НаСкладе,
	|	Строки.Количество КАК УПоставщика,
	|	0 КАК Поступило,
	|	Строки.Количество КАК Выбыло,
	|	0 КАК Отменено
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДД
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Ссылка = &Ссылка
	|	И НЕ Строки.Отменено
	|	И НЕ ДД.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ЗаказПоставщикуИсточникОбеспечения <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И Строки.бг_ЗаказКлиентаИсточникОбеспечения = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// резервирование долгосрочного резерва со склада под заказ клиента
	|ВЫБРАТЬ
	|	ДД.ДатаОтгрузки,
	|	Строки.бг_ЗаказКлиентаИсточникОбеспечения,
	|	Строки.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.Склад,
	|	Строки.Номенклатура,
	|	Строки.бг_УпаковкаПаллета,
	|	0 КАК НаСкладе,
	|	0 КАК УПоставщика,
	|	0 КАК Поступило,
	|	Строки.Количество КАК Выбыло,
	|	0 КАК Отменено
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДД
	|		ПО Строки.Ссылка = ДД.Ссылка
	|ГДЕ
	|	ДД.Ссылка = &Ссылка
	|	И НЕ Строки.Отменено
	|	И НЕ ДД.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ЗаказКлиентаИсточникОбеспечения <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|	И Строки.бг_ЗаказКлиентаИсточникОбеспечения.бг_ДолгосрочныйРезерв
	|	И Строки.бг_ЗаказПоставщикуИсточникОбеспечения = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И Строки.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить))";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
